spec/fixtures/xmls/request.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ns="https://onlineservice.creditreform.de/webservice/0710-0033">
  <soap:Header/>
  <soap:Body>
    <ns:testRequest>
      <ns:header>
        <ns:communicationlanguage>de</ns:communicationlanguage>
        <ns:transmissiontimestamp>2014-12-20T04:44:44+01:00</ns:transmissiontimestamp>
        <ns:keylistversion>36</ns:keylistversion>
        <ns:clientapplicationname>mocked_clientapplicationname</ns:clientapplicationname>
        <ns:clientapplicationversion>0</ns:clientapplicationversion>
        <ns:transactionreference>de5e81bef7d2f81f412a1ab17</ns:transactionreference>
        <ns:useraccount>mocked_useraccount</ns:useraccount>
        <ns:generalpassword>mocked_generalpassword</ns:generalpassword>
        <ns:individualpassword>mocked_individualpassword</ns:individualpassword>
      </ns:header>
      <ns:body>
        <ns:foo>bar</ns:foo>
        <ns:bar>foo</ns:bar>
      </ns:body>
    </ns:testRequest>
  </soap:Body>
</soap:Envelope>
